attached_assets/Pasted--ns0-Envelope-xmlns-ns0-http-schemas-xmlsoap-org-soap-envelope-xmlns-ns1-urn-BPMServicesIntf-I-1748406798651.txt

<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:BPMServicesIntf-IBPMServices">
  <ns0:Header/>
  <ns0:Body>
    <ns1:AtenderMensajeRNDC>
      <Request>
        <root>
          <acceso>
            <username>TRANSPORTES@739</username>
            <password>Alejandro_1971</password>
          </acceso>
          <solicitud>
            <tipo>1</tipo>
            <procesoid>3</procesoid>
          </solicitud>
          <variables>
            <NUMNITEMPRESATRANSPORTE>9013690938</NUMNITEMPRESATRANSPORTE>
            <CONSECUTIVOREMESA>79824014</CONSECUTIVOREMESA>
            <CODOPERACIONTRANSPORTE>G</CODOPERACIONTRANSPORTE>
            <CODNATURALEZACARGA>1</CODNATURALEZACARGA>
            <CANTIDADCARGADA>7000</CANTIDADCARGADA>
            <UNIDADMEDIDACAPACIDAD>1</UNIDADMEDIDACAPACIDAD>
            <CODTIPOEMPAQUE>0</CODTIPOEMPAQUE>
            <MERCANCIAREMESA>002309</MERCANCIAREMESA>
            <DESCRIPCIONCORTAPRODUCTO>ALIMENTO PARA AVES DE CORRAL</DESCRIPCIONCORTAPRODUCTO>
            <CODTIPOIDREMITENTE>N</CODTIPOIDREMITENTE>
            <NUMIDREMITENTE>8600588314</NUMIDREMITENTE>
            <CODSEDEREMITENTE>002</CODSEDEREMITENTE>
            <CODTIPOIDDESTINATARIO>N</CODTIPOIDDESTINATARIO>
            <NUMIDDESTINATARIO>8600588314</NUMIDDESTINATARIO>
            <CODSEDEDESTINATARIO>009</CODSEDEDESTINATARIO>
            <DUENOPOLIZA>N</DUENOPOLIZA>
            <HORASPACTOCARGA>2</HORASPACTOCARGA>
            <HORASPACTODESCARGUE>2</HORASPACTODESCARGUE>
            <CODTIPOIDPROPIETARIO>N</CODTIPOIDPROPIETARIO>
            <NUMIDPROPIETARIO>9013690938</NUMIDPROPIETARIO>
            <CODSEDEPROPIETARIO>01</CODSEDEPROPIETARIO>
            <FECHACITAPACTADACARGUE>28/05/2025</FECHACITAPACTADACARGUE>
            <HORACITAPACTADACARGUE>08:00</HORACITAPACTADACARGUE>
            <FECHACITAPACTADADESCARGUE>28/05/2025</FECHACITAPACTADADESCARGUE>
            <HORACITAPACTADADESCARGUEREMESA>13:00</HORACITAPACTADADESCARGUEREMESA>
          </variables>
        </root>
      </Request>
    </ns1:AtenderMensajeRNDC>
  </ns0:Body>
</ns0:Envelope>